yusuf7855/Controlling-the-brightness-of-3-LEDs-using-PWM-signals-on-STM32F746g--Discovery-board/Core/Src/main.c
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartHardwareTask */
/**
* @brief Function implementing the hardwareTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartHardwareTask */
void StartHardwareTask(void const * argument)
{
  /* USER CODE BEGIN StartHardwareTask */
  /* Infinite loop */
  for(;;)
  {

    osDelay(1);
  }
  /* USER CODE END StartHardwareTask */
}

/* USER CODE BEGIN Header_StartGFXTask */
/**
* @brief Function implementing the myGFXtask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartGFXTask */
void StartGFXTask(void const * argument)
{
  /* USER CODE BEGIN StartGFXTask */

	MX_TouchGFX_Process();
  /* Infinite loop */
  for(;;)
  {

  }
  /* USER CODE END StartGFXTask */
}

/* USER CODE BEGIN Header_StartTaskUartMsg */
/**
* @brief Function implementing the taskUartMsg thread.
* @param argument: Not used
* @retval None
*/

/* USER CODE END Header_StartTaskUartMsg */
void StartTaskUartMsg(void const * argument)
{
  /* USER CODE BEGIN StartTaskUartMsg */
	PollingInit();

  /* Infinite loop */
  for(;;)
  {
	  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3);
	 	  __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_3, counter);
	 	   HAL_Delay(1);
	 	  __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_3, counter);
	 	   HAL_Delay(1);
    osDelay(1);
	  HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_4);
	  __HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_4, endo);
      HAL_Delay(1);
      __HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_4, endo);
	  HAL_Delay(1);
	  	  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
	  	 	   __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_4, counter1);
	  	        HAL_Delay(1);
	  	 	   __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_4, counter1);
	  	 	   HAL_Delay(1);


	  PollingRoutine();

    osDelay(1);
  }
  /* USER CODE END StartTaskUartMsg */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
